Revit 2027 API
EnergyAnalysisSurfaceType Enumeration
Note: This API is now obsolete.
 Analytical surface types.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This enumuration is deprecated in Revit 2027 and may be removed in a later version of Revit. Use gbXMLSurfaceType instead.")]
public enum EnergyAnalysisSurfaceType
<ObsoleteAttribute("This enumuration is deprecated in Revit 2027 and may be removed in a later version of Revit. Use gbXMLSurfaceType instead.")>
Public Enumeration EnergyAnalysisSurfaceType
[ObsoleteAttribute(L"This enumuration is deprecated in Revit 2027 and may be removed in a later version of Revit. Use gbXMLSurfaceType instead.")]
public enum class EnergyAnalysisSurfaceType
[<ObsoleteAttribute("This enumuration is deprecated in Revit 2027 and may be removed in a later version of Revit. Use gbXMLSurfaceType instead.")>]
type EnergyAnalysisSurfaceType
Members
Member name | Value | Description
Air | 7 |  Air.
Ceiling | 3 |  Ceiling.
ExteriorFloor | 5 |  Exterior floor.
ExteriorWall | 1 |  Exterior wall.
InteriorFloor | 4 |  Interior floor.
InteriorWall | 2 |  Interior wall.
Roof | 0 |  Roof.
Shading | 6 |  Shading.
Underground | 8 |  Underground
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace